<template lang="pug">
section#about
  .container
    .content
      .description
        .wrap
          UITitleIcon О нас
          h2 Почему именно мы?
          p
            | Молодая команда докторов, влюблённых в профессию,
            | развивающаяся и повышающая свою квалификацию согласно
            | последним мировым тенденциям.
          p
            | Специалисты нашего центра убеждены, что
            | качество жизни — это не фантазия, а реальная необходимость в
            | современном мире, уделяя внимание не только устранению симптомов,
            | но и лечению причины заболевания.
          p
            | Поход к врачу — это всегда стресс, мы стараемся минимизировать
            | его, выступая в качестве помощников и советчиков, помогая,
            | а не нравоучая и осуждая
      .cards
        AboutCard(
                v-for="card in ['priceDown', 'personUp', 'calendar', 'person']"
                :card="card"
              )
    .counter.u-no-select
      .count(v-for="i in countList")
        span {{ i.value }}
        p {{ i.title }}
</template>

<script>

export default {
  name: 'appAbout',
  data () {
    return {
      countList: [
        {
          value: '>400',
          title: 'Женщин прошли комплексную диагностику женского здоровья'
        },
        {
          value: '>500',
          title: 'Мы произвели лабораторных исследований за 2022 год'
        },
        {
          value: '52%',
          title: 'Пациентов пришли к нам по рекомендации друзей'
        },
        {
          value: '>300',
          title: 'Женщин прошли курс лечения после диагностики'
        }
      ]
    }
  }
}

</script>
  