<template lang="pug">
section#reviews
  .container
    .title
      UITitleIcon Отзывы
      h2 Что говорят наши пациенты
      p
        | Наши пациенты знают, что наша миссия — забота о здоровье.
        | Каждый человек для нас уникален. Приходите к нам и почувствуйте это
    .slider.u-no-select
      UISVGIcon.bg-blur(icon="ellipse")
      UISVGIcon.bg-blur(icon="ellipse")
      .buttonSlider
        UISVGIcon(icon="arrow" @click="previous()")
        UISVGIcon(icon="arrow" @click="next()")
      flickity.carousel(
        ref="flickity"
        :options="flickityOptions")
        .carousel-cell(v-for="i in reviewsList")
          .header
            UISVGIcon(icon="mark")
            h4 {{ i.title }}
          .body
            p {{ i.content }}
            .footer
              span {{ i.name }}
              span {{ i.date }}
</template>

<script>
import Flickity from 'vue-flickity'

export default {
  name: 'appReviews',
  components: {
    Flickity
  },
  data () {
    return {
      flickityOptions: {
        wrapAround: true,
        cellAlign: 'left',
        prevNextButtons: false
      },
      reviewsList:
      [
        {
          title: "Доктор мгновенно разобралась в проблеме. Муж счастлив!",
          content: "У мужа очень болела спина, в поликлинике помочь нам не смогли. Решили попробовать записаться в ЦАОП № 1, а вдруг…и не пожалели. Доктор мгновенно разобралась в проблеме, провела необходимые обследования и назначила лечение. Муж счастлив. Сегодня впервые проснулся без боли. Спасибо вам!",
          name: "Елена Соколова",
          date: "17.02.2022"
        },
        {
          title: "Атмосфера, отношение, прием. Теперь только к вам!",
          content: "Недавно обратили внимание на то, что прямо рядом с домом открылась новая клиника. Решили с супругой зайти, сдать анализы, и были приятно удивлены. Атмосфера, отношение, приём. Жена очень боится вида крови, но даже она не успела заметить процедуру, насколько быстро и безболезненно медсестра взяла анализ. Также приятно порадовала цена. Теперь только к вам!",
          name: "Иван Соколов",
          date: "27.06.2022"
        },
        {
          title: "Полный восторг! Врач вежливый, внимательный, учтивый",
          content: "Нужно было срочно попасть на приём к гинекологу и тут случайно узнала об открытии вашей клиники. Что ж, решила попробовать. Полный восторг, врач очень вежливый, внимательный, учтивый, приём прошёл в тёплой доброжелательной обстановке. С удовольствием вернусь, спасибо!",
          name: "Светлана",
          date: "04.03.2022"
        },
        {
          title: "Вежливый персонал. Рядом с домом",
          content: "Вежливый персонал. Есть основные услуги. Рядом с домом (в нашем районе вообще с платными мёд.центрами тяжко). Онкологическая направленность тоже плюс. Если бы УЗИ сердца было, то вообще сказка:)))",
          name: "AnatotachiBaka",
          date: "28.04.2022"
        },
        {
          title: "Анализы делаю быстро, по цене ниже, чем у других",
          content: "Вежливый персонал, анализы делают быстро, по цене ниже, чем у других, медсестра хорошая, кровь взяла аккуратно, после спросила как самочувствие, замотала в медицинский бинт специальный, в общем рекомендую, если сдавать анализы, то только сюда",
          name: "Александр Л.",
          date: "20.04.2022"
        },
        {
          title: "Запись удобна в любое время. Работают в выходные",
          content: "Новый медицинский центр, запись удобна в любое время. До обеда, а также вечернее и выходные работают. Проходила УЗИ обследование",
          name: "Олеся Г.",
          date: "14.06.2022"
        }
      ]
    }
  },
  methods: {
    next () {
      this.$refs.flickity.next()
    },
    previous () {
      this.$refs.flickity.previous()
    }
  },
}
</script>